#include <iostream>
/*
0. Рендер
  -Линии толщиной "1 ШМИКСЕЛЬ" 
  -Линии могут иметь толщину
  -Сглаживание
1. Создавать разные фигуры
2. Камера: отображать СК
  -по умолчанию
  -в заданной позиции
  -камера примязана к фигуре
  -создать/удалить/добавить
3. Операции с фигурами
  -подвинуть "на"
  -переместить "в"
  -поворот
  -рисование кривых и косых линий
  -комбинация фигур
  -слои и разные символы
4. Сохранить/Загрузить рабочую область
  -открыть
  -закрыть
  -удалить
  -состояние проекта
5. Мета-команды
  -Хелп/описание
  -макросы
  -чтение комманд из файла
  -сохранение/загрузка макросов
...
*/

int main()
{}